## Reindexing

In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [4]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
obj2 = obj.reindex("a b c d e".split())

In [6]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or filling
of values when reindexing. The method option allows us to do this, using a
method such as **ffill**, which forward-fills the values:

In [7]:
obj3 = pd.Series(data = "blue purple yellow".split(),index = [0,2,4])

In [8]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [10]:
obj3.reindex(range(6),method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [13]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index="a c d".split(), columns = "Ohio Texas California".split())

In [14]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [15]:
frame.reindex(["a","b","c","d"])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [17]:
# The columns can be reindexed with the columns keyword:

In [18]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [19]:
states = ['Texas', 'Utah', 'California']

In [20]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [21]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8